app/operations/bank_accounts/perform_transaction.rb

    def initialize(amount:, transaction_type:, bank_account_id:, recipient_id:)
      @amount = amount.try(:to_f)
      @transaction_type = transaction_type
      @bank_account_id = bank_account_id
      @recipient_id = recipient_id
      @bank_account = BankAccount.where(id: bank_account_id).first
      @recipient_account = BankAccount.where(account_number: recipient_id).first
---
SELECT  "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."id" = ? ORDER BY "bank_accounts"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_number" = ? ORDER BY "bank_accounts"."id" ASC LIMIT ?  [["account_number", "ec2fa2f0-9f9d-422e-ba76-708acd89c4a9"], ["LIMIT", 1]]

    def create_transaction!(bank_account, amount, transaction_type, recipient_id)
        AccountTransaction.create!(
          bank_account: bank_account,
          amount: amount,
          transaction_type: transaction_type,
          recipient_id: recipient_id
        )
        tax_nine_to_eighteen = 5
        #tax_another_time = 7 Pendente
        #tax_greater_than_thousand = 10 #Pendente
        bank_account.update(balance: bank_account.balance - amount) if transaction_type == "Saque"
        bank_account.update(balance: bank_account.balance - amount - tax_nine_to_eighteen) if transaction_type == "Transferencia"
        bank_account.update(balance: bank_account.balance + amount) if transaction_type == "Depósito"
---
INSERT INTO "account_transactions" ("amount", "transaction_type", "bank_account_id", "created_at", "updated_at", "transaction_number", "recipient_id") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "bank_accounts" SET "balance" = ?, "updated_at" = ? WHERE "bank_accounts"."id" = ?  [["balance", 55.0], ["updated_at", "2022-08-09 17:23:32.320959"], ["id", 1]]
UPDATE "bank_accounts" SET "balance" = ?, "updated_at" = ? WHERE "bank_accounts"."id" = ?  [["balance", 113.0], ["updated_at", "2022-08-09 17:19:37.886508"], ["id", 1]]
UPDATE "bank_accounts" SET "balance" = ?, "updated_at" = ? WHERE "bank_accounts"."id" = ?  [["balance", 85.0], ["updated_at", "2022-08-09 18:34:12.812948"], ["id", 1]]