app/operations/bank_accounts/validate_new_transaction.rb

SELECT  "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."id" = ? ORDER BY "bank_accounts"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_number" = ? ORDER BY "bank_accounts"."id" ASC LIMIT ?  [["account_number", "ec2fa2f0-9f9d-422e-ba76-708acd89c4a9"], ["LIMIT", 1]]
---
    def initialize(amount:, transaction_type:, bank_account_id:, recipient_id:)
      @amount = amount.try(:to_f)
      @transaction_type = transaction_type
      @bank_account_id = bank_account_id
      @recipient_id = recipient_id
      @bank_account = BankAccount.where(id: @bank_account_id).first
      @recipient_account = BankAccount.where(account_number: @recipient_id).first