app/views/bank_accounts/_transactions.html.haml

SELECT "account_transactions".* FROM "account_transactions" WHERE "account_transactions"."bank_account_id" = ?  [["bank_account_id", 1]]
---
  %tbody
    - bank_account.account_transactions.each do |t|