app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @bank_account = BankAccount.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
      user = User.last
      BankAccount.create!(user: user)
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "bank_accounts" ("user_id", "balance", "account_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["balance", 0.0], ["account_number", "ec2fa2f0-9f9d-422e-ba76-708acd89c4a9"], ["created_at", "2022-08-08 23:27:45.786084"], ["updated_at", "2022-08-08 23:27:45.786084"]]